Still not reproducible:

```hcl
resource "databricks_sql_endpoint" "default" {
  name                      = "Default"
  cluster_size              = "X-Small"
  max_num_clusters          = 2
  auto_stop_mins            = 1
  enable_photon             = true
  enable_serverless_compute = true
  warehouse_type            = "PRO"
}
```

Creation:

```
# tf-tests/issue-3116\>terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_sql_endpoint.default will be created
  + resource "databricks_sql_endpoint" "default" {
      + auto_stop_mins            = 1
      + cluster_size              = "X-Small"
      + creator_name              = (known after apply)
      + data_source_id            = (known after apply)
      + enable_photon             = true
      + enable_serverless_compute = true
      + health                    = (known after apply)
      + id                        = (known after apply)
      + jdbc_url                  = (known after apply)
      + max_num_clusters          = 2
      + name                      = "Default"
      + num_active_sessions       = (known after apply)
      + num_clusters              = (known after apply)
      + odbc_params               = (known after apply)
      + spot_instance_policy      = "COST_OPTIMIZED"
      + state                     = (known after apply)
      + warehouse_type            = "PRO"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

databricks_sql_endpoint.default: Creating...
databricks_sql_endpoint.default: Creation complete after 8s [id=4041dc2e82243f02]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Plan:

```
# tf-tests/issue-3116\>terraform plan
databricks_sql_endpoint.default: Refreshing state... [id=4041dc2e82243f02]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences,
so no changes are needed.
```

```
# tf-tests/issue-3116\>terraform -v
Terraform v1.5.7
on darwin_arm64
+ provider registry.terraform.io/databricks/databricks v1.34.0
```

Please collect logs for `terraform plan`